AccumulationRegisters/РСК_УслугиСоисполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>РСК_УслугиСоисполнителей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриобретениеУслугПрочихАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриобретениеУслугПрочихАктивов</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РСК_УслугиСоисполнителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПодДеятельность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КомментарийРаспределения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаДоходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УдалитьАналитикаУчетаПартий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСК_ИдентификаторСтрокиЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/РСК_ФормаПодбораСтрок/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") Тогда
		ДокументОснование = Параметры.Основание;
		Соисполнитель 	  = ПартнерСоисполнительДокументаОснования(ДокументОснование); 
		Сделка			  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОСнование,"Сделка");
	ИначеЕсли Параметры.Свойство("Соисполнитель") Тогда
		РежимПодбораВДокумент = Истина; 
		Соисполнитель = Параметры.Соисполнитель;
	КонецЕсли; 
	ЗаполнитьСписокДокументов(Сделка);
	УстановитьОформлениеФормы();
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокСтрокКоличествоВДокументПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.СписокСтрок.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		Если ТекущиеДанные.Количество > ТекущиеДанные.КоличествоДоступно Тогда
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоДоступно;	
		КонецЕсли;
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;	
	КонецЕсли;  
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокСтрокЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокСтрок.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура СоисполнительПриИзменении(Элемент)
	ЗаполнитьСписокДокументов();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Далее(Команда) 
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПодборСтрок;
	ДалееНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ДалееНаСервере()
	ЗаполнитьСписокСтрок();
КонецПроцедуры  

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаПодборДокументов;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	ВыбранныеСтроки     = СтрокиДляПереносаВДокумент();  
	Если РежимПодбораВДокумент Тогда 
		СтруктураЗакрытия = Новый Структура("АдресСтрокВоВременномХранилище",ВыбранныеСтроки);
		Закрыть(СтруктураЗакрытия);	
	Иначе
		ПараметрыОснования  = Новый Структура("ДокументОснование,АдресСтрокВоВременномХранилище",ДокументОснование,ВыбранныеСтроки);
		ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.ФормаОбъекта", Новый Структура("Основание",ПараметрыОснования));  
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОформлениеФормы()
	
	Если РежимПодбораВДокумент Тогда
		Элементы.СоздатьДокумент.Заголовок 	   = "Перенести в документ";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументов(Сделка = Неопределено)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = ТекстЗапросаСписокСделок(); 
	Запрос.УстановитьПараметр("ОтборНеУстановлен",НЕ ЗначениеЗаполнено(Соисполнитель));
	Запрос.УстановитьПараметр("Сделки",Сделка); 
	Запрос.УстановитьПараметр("Партнер",Соисполнитель);
	Запрос.УстановитьПараметр("РольПартнера",Справочники.РолиПартнеровВСделкахИПроектах.НайтиПоНаименованию("Соисполнитель"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	СписокДокументов.Загрузить(Результат);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокСтрок() 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ИнициализироватьТаблицуВыбранныхОбъектов(Запрос);
	Запрос.Текст = ТекстЗапросаЗаполнитьСтроки();	

	Результат = Запрос.Выполнить().Выгрузить();
	СписокСтрок.Загрузить(Результат);

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТаблицуВыбранныхОбъектов(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокДокументов.Ссылка КАК Ссылка,
	|	СписокДокументов.Пометка КАК Пометка
	|ПОМЕСТИТЬ ВТ_ДокументыДляФормирования
	|ИЗ
	|	&СписокДокументов КАК СписокДокументов
	|ГДЕ
	|	СписокДокументов.Пометка";
	Запрос.УстановитьПараметр("СписокДокументов",СписокДокументов.Выгрузить());
	Запрос.Выполнить();
	
КонецПроцедуры  

&НаСервере
Функция СтрокиДляПереносаВДокумент() 
		
 	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеОтбора", СписокСтрок.Выгрузить());
	Запрос.УстановитьПараметр("Статья", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("121008")); 
	Запрос.УстановитьПараметр("АналитикаРасходов", Соисполнитель);
	Запрос.УстановитьПараметр("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеОтбора.Количество КАК Количество,
	|	ДанныеОтбора.Цена КАК Цена,
	|	ДанныеОтбора.Сумма КАК Сумма,
	|	ДанныеОтбора.Документ КАК Документ,
	|	ДанныеОтбора.Услуга КАК Содержание
	|ПОМЕСТИТЬ ВТ_ДанныеОтбора
	|ИЗ
	|	&ДанныеОтбора КАК ДанныеОтбора
	|ГДЕ
	|	ДанныеОтбора.Пометка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОтбора.Содержание КАК Содержание,
	|	ВТ_ДанныеОтбора.Количество КАК Количество,
	|	ВТ_ДанныеОтбора.Цена КАК Цена,
	|	ВТ_ДанныеОтбора.Сумма КАК Сумма,
	|	&Статья КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	&СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ДанныеОтбора.Сумма КАК СуммаСНДС,
	|	ВТ_ДанныеОтбора.Документ КАК Сделка
	|ИЗ
	|	ВТ_ДанныеОтбора КАК ВТ_ДанныеОтбора"; 
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	СтрокиОснования = ПоместитьВоВременноеХранилище(Результат,Новый УникальныйИдентификатор);
	
	Возврат СтрокиОснования;
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПартнерСоисполнительДокументаОснования(ДокументОснование) 
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Склад"); 
	Если ЗначениеЗаполнено(Склад) Тогда
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад,"Поклажедержатель");
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"Партнер");	
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено; 
	
КонецФункции   

&НаСервереБезКонтекста
Функция ТекстЗапросаСписокСделок()

	Текст = "ВЫБРАТЬ
	        |	РСК_УслугиСоисполнителейОстатки.Сделка КАК Ссылка,
	        |	ВЫБОР
	        |		КОГДА РСК_УслугиСоисполнителейОстатки.Сделка В (&Сделки)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК Пометка
	        |ИЗ
	        |	РегистрНакопления.РСК_УслугиСоисполнителей.Остатки(
	        |			,
	        |			&ОтборНеУстановлен
	        |				ИЛИ Сделка В
	        |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |						СделкиСКлиентамиПартнерыИКонтактныеЛица.Ссылка КАК Ссылка
	        |					ИЗ
	        |						Справочник.СделкиСКлиентами.ПартнерыИКонтактныеЛица КАК СделкиСКлиентамиПартнерыИКонтактныеЛица
	        |					ГДЕ
	        |						СделкиСКлиентамиПартнерыИКонтактныеЛица.Партнер = &Партнер
	        |						И СделкиСКлиентамиПартнерыИКонтактныеЛица.РольПартнера = &РольПартнера)) КАК РСК_УслугиСоисполнителейОстатки
	        |ГДЕ
	        |	РСК_УслугиСоисполнителейОстатки.КоличествоОстаток > 0"; 
	
	Возврат Текст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаЗаполнитьСтроки()
	
	Текст = 
	"ВЫБРАТЬ
	|	РСК_УслугиСоисполнителейОстатки.Сделка КАК Документ,
	|	РСК_УслугиСоисполнителейОстатки.Содержание КАК Услуга,
	|	РСК_УслугиСоисполнителейОстатки.КоличествоОстаток КАК КоличествоДоступно
	|ИЗ
	|	РегистрНакопления.РСК_УслугиСоисполнителей.Остатки(
	|			,
	|			Сделка В
	|				(ВЫБРАТЬ
	|					ВТ_ДокументыДляФормирования.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_ДокументыДляФормирования КАК ВТ_ДокументыДляФормирования)) КАК РСК_УслугиСоисполнителейОстатки
	|ГДЕ
	|	РСК_УслугиСоисполнителейОстатки.КоличествоОстаток > 0";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
